emacs/modules/tdtron-coq.org
#+title Coq config
#+PROPERTY: header-args:emacs-lisp :tangle tdtron-coq.el :mkdirp yes

#+begin_src emacs-lisp
  ;;; tdtron-coq.el -*- lexical-binding: t; -*-

  ;; Copyright (C) 2022
  ;; SPDX-License-Identifier: MIT

  ;; Author: Tomas Diaz

  ;; Commentary

  ;; Coq configuration

  ;;; Code:
#+end_src

* Setup
#+begin_src emacs-lisp
  (crafted-package-install-package 'proof-general)
  (setq proof-three-window-mode-policy 'hybrid) ;; Set default layout to hybrid
  ;; proof-locked-face allows customizing background color I think
#+end_src

* Company-Coq
#+begin_src emacs-lisp
  (crafted-package-install-package 'company-coq)
  (add-hook 'coq-mode-hook #'company-coq-mode)
#+end_src

* Provide pkg
#+begin_src emacs-lisp
  (provide 'tdtron-coq)
  ;;; tdtron-coq.el ends here
#+end_src
